@lucasbnimbux @federicoaaguirre 
Ya corregi los cambios necesarios para mergear.
Ejecute un plan tanto en QA y en Prod y me saltan unas modificaciones en ambos ambientes que no comprendo. Puede ser algo de mi entorno local?

Lo vemos el Jueves cualquier cosa.
```
$ ./terraform.sh plan production siab
Using bucket [doppler-tf-states] for account [288672893446]
Planning for Environment: production Region: us-east-2
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.iam: Reading...
data.template_file.doppler_userdata: Reading...
data.template_file.doppler_userdata: Read complete after 0s [id=34a5f4d88fa34242d84fde7f84bcec19178c6dbb7a340b80483f7a6d640a1d02]
data.aws_elb_service_account.main: Reading...
data.aws_caller_identity.current: Reading...
module.app_asg.data.aws_ami.ami: Reading...
data.aws_elb_service_account.main: Read complete after 0s [id=033677994240]
data.terraform_remote_state.iam: Read complete after 3s
aws_iam_instance_profile.iam_siab_servers_profile: Refreshing state... [id=iam_siab_servers_profile_production]
data.terraform_remote_state.vpc: Read complete after 3s
aws_lb_target_group.http_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:288672893446:targetgroup/prd-doppler-shopify-http/988e93349a34af26]
aws_lb_target_group.https_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:288672893446:targetgroup/prd-doppler-shopify-https/1f5b1e76abdc1297]
data.aws_caller_identity.current: Read complete after 1s [id=288672893446]
aws_security_group.alb_security_group: Refreshing state... [id=sg-096b1b524741a8af0]
aws_security_group.doppler_security_group: Refreshing state... [id=sg-068a60b5b302d9e9a]
module.app_asg.data.aws_ami.ami: Read complete after 1s [id=ami-0099a00566287a28a]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:288672893446:loadbalancer/app/prd-doppler-shopify-alb/a053fbaa230c3dc3]
aws_security_group_rule.alb_security_group_egress: Refreshing state... [id=sgrule-1842080443]
module.app_asg.aws_launch_configuration.lc: Refreshing state... [id=prd-doppler-shopify-lc20230710193709130100000001]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:288672893446:listener/app/prd-doppler-shopify-alb/a053fbaa230c3dc3/7cb42f07b6dc1bc2]
aws_lb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:288672893446:listener/app/prd-doppler-shopify-alb/a053fbaa230c3dc3/f0a2a55badf153a9]
module.app_asg.aws_autoscaling_group.asg: Refreshing state... [id=prd-doppler-shopify-asg]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app_asg.aws_autoscaling_group.asg will be updated in-place
  ~ resource "aws_autoscaling_group" "asg" {
        id                        = "prd-doppler-shopify-asg"
      ~ launch_configuration      = "prd-doppler-shopify-lc20230710193709130100000001" -> (known after apply)
        name                      = "prd-doppler-shopify-asg"
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app_asg.aws_launch_configuration.lc must be replaced
+/- resource "aws_launch_configuration" "lc" {
      ~ arn                         = "arn:aws:autoscaling:us-east-2:288672893446:launchConfiguration:3c79c743-136b-4824-81ba-92cb0ac0c961:launchConfigurationName/prd-doppler-shopify-lc20230710193709130100000001" -> (known after apply)
      ~ associate_public_ip_address = false -> (known after apply)
      ~ id                          = "prd-doppler-shopify-lc20230710193709130100000001" -> (known after apply)
      ~ name                        = "prd-doppler-shopify-lc20230710193709130100000001" -> (known after apply)
      ~ user_data                   = "7de90a85426b005d294456ef70f1e3166b3df19a" -> "76409f9a03bf5da9277852ae400a1cef83db9591" # forces replacement
        # (8 unchanged attributes hidden)

      ~ root_block_device {
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 0 -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "account" but a value was found in file "terraform.tfvars". If you meant to use this value, add a "variable" block to the configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide certain "global" settings to all configurations in your organization. To reduce the verbosity of these warnings, use    
│ the -compact-warnings option.
```